cdt.org
* Day One
** Writing software is about telling computers what to do. Why might this be challenging for humans to do effectively?
- Language - we don't speak the same one
- Short-term "working" memory (inability to hold all of a piece of code at the same time)
- Prone to mistakes / inaccuracy
- Ego - we tend to assume we don't make mistakes (or make a lot of them)
- Long-term memory (what was I thinking six months ago?)
- Not perfect logical reasoning machines (prone to logical mistakes), thinking clearly is hard
- Need familiarity - hard to remember/understand unfamiliar things
- We're sometimes inconsistent (especially in groups)
- Prone to making typos/errors
- Conclusions - we for a mental model about systems that we have only partial information on (and their internals)
- Communication - sometimes write software that makes sense to us (primarily), doesn't communicate intent
- Simplicity is subjective
- We're slower than computers (to run logic)
- Can't accumulate complex, inter-dependent program state (like computers)
- Ego - we tend to think we're right (or wrong)
- We remember/understand through patterns, not unconnected (or massively connected) data
- need multiple attempts to write correct logic (make both reasoning errors and coding errors) 
- writing code is slow (compared to the complexity of programs)
- Things I haven't touched on:
   * variable naming
   * "visuals" (indentation, whitespace, conventions)
   * software complexity accumulates
   * debugging?
   * using libraries (with well-defined interfaces and docs) because we don't want to build from scratch
** What techniques, methods or language features would help mitigate these?
- High-level languages (common language)
- group instructions into larger tasks which make sense together (e.g. functions)
- Create an easy way to "use" these larger tasks, as if they where part of the language (i.e. function interfaces)
- Write the function interfaces in ways that are general that can be reused (but not so general they're not useful)
- Avoid copies/duplication of information in different places (variable passing)
- Name variables clearly
- Follow sensible conventions: naming functions, naming variables, consistent indentation, meaningful names
- Avoid repetition - loops, functions, generalising functions
- High-level abstractions/language (functions)
- Encapsulation
- Continuously make sure the code is working
- Keep track of all the work you've done (in a consistent state)
** Using your imagination invent some tools (that may or may not exist) that would make development of software simpler, quicker and more productive. :SLIDES:
- automated testing tools
- version control
- syntax highlighting
- snippets
- auto-completion
- syntax checkers
- auto-formatters / format or style checkers (indentation, naming, spaces, conventions)
- context-aware refactoring tools
- documentation searching
- trello
** Consider these pieces of code, what are the advantages and disadvantages of each?
   Also maybe do one with a dict....!??? Print in large and also in small.
