cdt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-24 Tue 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Dawson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0babef5">1. Day One</a>
<ul>
<li><a href="#orge66e8e0">1.1. Writing software is about telling computers what to do. Why might this be challenging for humans to do effectively?</a></li>
<li><a href="#orgf938273">1.2. What techniques, methods or language features would help mitigate these?</a></li>
<li><a href="#org6bbbd06">1.3. Using your imagination invent some tools (that may or may not exist) that would make development of software simpler, quicker and more productive.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></a></li>
<li><a href="#org5b20917">1.4. Consider these pieces of code, what are the advantages and disadvantages of each?</a>
<ul>
<li><a href="#org58b849b">1.4.1. Example</a></li>
<li><a href="#org26204a9">1.4.2. Example</a></li>
<li><a href="#org893ebd1">1.4.3. Example 1</a></li>
<li><a href="#org2047d25">1.4.4. Example 2</a></li>
<li><a href="#org76190ae">1.4.5. Example</a></li>
<li><a href="#org066da16">1.4.6. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd185d30">2. Day Two</a>
<ul>
<li><a href="#orgdd35fc8">2.1. Code challenge intro&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></a>
<ul>
<li><a href="#orgc163687">2.1.1. The scenario</a></li>
<li><a href="#org0e43885">2.1.2. Your job</a></li>
<li><a href="#orgcba015b">2.1.3. You should expect that</a></li>
<li><a href="#org4b75eb4">2.1.4. The problem</a></li>
</ul>
</li>
<li><a href="#orge39271d">2.2. What challenges do you anticipate delivering this software in a team, and responding to customer needs?</a></li>
<li><a href="#org4b57c27">2.3. Can you imagine some ways of working that might resolve these issues? discuss this in your group, and write a series of short bullet points describing the process you would use.</a></li>
<li><a href="#org6fc0be5">2.4. The proposed methodology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0babef5" class="outline-2">
<h2 id="org0babef5"><span class="section-number-2">1</span> Day One</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge66e8e0" class="outline-3">
<h3 id="orge66e8e0"><span class="section-number-3">1.1</span> Writing software is about telling computers what to do. Why might this be challenging for humans to do effectively?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Language - we don't speak the same one</li>
<li>Short-term "working" memory (inability to hold all of a piece of code at the same time)</li>
<li>Prone to mistakes / inaccuracy</li>
<li>Ego - we tend to assume we don't make mistakes (or make a lot of them)</li>
<li>Long-term memory (what was I thinking six months ago?)</li>
<li>Not perfect logical reasoning machines (prone to logical mistakes), thinking clearly is hard</li>
<li>Need familiarity - hard to remember/understand unfamiliar things</li>
<li>We're sometimes inconsistent (especially in groups)</li>
<li>Prone to making typos/errors</li>
<li>Conclusions - we for a mental model about systems that we have only partial information on (and their internals)</li>
<li>Communication - sometimes write software that makes sense to us (primarily), doesn't communicate intent</li>
<li>Simplicity is subjective</li>
<li>We're slower than computers (to run logic)</li>
<li>Can't accumulate complex, inter-dependent program state (like computers)</li>
<li>Ego - we tend to think we're right (or wrong)</li>
<li>We remember/understand through patterns, not unconnected (or massively connected) data</li>
<li>need multiple attempts to write correct logic (make both reasoning errors and coding errors)</li>
<li>writing code is slow (compared to the complexity of programs)</li>
<li>Things I haven't touched on:
<ul class="org-ul">
<li>variable naming</li>
<li>"visuals" (indentation, whitespace, conventions)</li>
<li>software complexity accumulates</li>
<li>debugging?</li>
<li>using libraries (with well-defined interfaces and docs) because we don't want to build from scratch</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf938273" class="outline-3">
<h3 id="orgf938273"><span class="section-number-3">1.2</span> What techniques, methods or language features would help mitigate these?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>High-level languages (common language)</li>
<li>group instructions into larger tasks which make sense together (e.g. functions)</li>
<li>Create an easy way to "use" these larger tasks, as if they where part of the language (i.e. function interfaces)</li>
<li>Write the function interfaces in ways that are general that can be reused (but not so general they're not useful)</li>
<li>Avoid copies/duplication of information in different places (variable passing)</li>
<li>Name variables clearly</li>
<li>Follow sensible conventions: naming functions, naming variables, consistent indentation, meaningful names</li>
<li>Avoid repetition - loops, functions, generalising functions</li>
<li>High-level abstractions/language (functions)</li>
<li>Encapsulation</li>
<li>Continuously make sure the code is working</li>
<li>Keep track of all the work you've done (in a consistent state)</li>
</ul>
</div>
</div>
<div id="outline-container-org6bbbd06" class="outline-3">
<h3 id="org6bbbd06"><span class="section-number-3">1.3</span> Using your imagination invent some tools (that may or may not exist) that would make development of software simpler, quicker and more productive.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>automated testing tools</li>
<li>version control</li>
<li>syntax highlighting</li>
<li>snippets</li>
<li>auto-completion</li>
<li>syntax checkers</li>
<li>auto-formatters / format or style checkers (indentation, naming, spaces, conventions)</li>
<li>context-aware refactoring tools</li>
<li>documentation searching</li>
<li>trello</li>
</ul>
</div>
</div>
<div id="outline-container-org5b20917" class="outline-3">
<h3 id="org5b20917"><span class="section-number-3">1.4</span> Consider these pieces of code, what are the advantages and disadvantages of each?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Also maybe do one with a dict&#x2026;.!??? Print in large and also in small.
</p>
</div>
