cdt.org
*** Example
#+begin_src python
  import random
  import matplotlib.pyplot as plt

  n = 10**3

  n_inside_circle = 0

  # variables for circle
  x_inside_circle = []
  y_inside_circle = []
  x_outside_circle = []
  y_outside_circle = []

  # variables for sphere
  n_inside_sphere = 0

  # compute number of points for circle
  for i in range(n):
      x = random.uniform(-1.0, 1.0)
      y = random.uniform(-1.0, 1.0)
      if x**2 + y**2 <= 1:
          x_inside_circle.append(x)
          y_inside_circle.append(y)
          continue

      x_outside_circle.append(x)
      y_outside_circle.append(y)

  # compute number inside sphere
  for i in range(n):
      x = random.uniform(-1.0, 1.0)
      y = random.uniform(-1.0, 1.0)
      z = random.uniform(-1.0, 1.0)
      if x**2 + y**2 + z**2 <= 1:
          n_inside_sphere += 1

  # count variables for circle and sphere
  n_inside_circle = len(x_inside_circle)

  # compute pi for circle and sphere
  pi_circle = 4 * (n_inside_circle / n)
  pi_sphere = 6 * (n_inside_sphere / n)

  # print results
  print(f'using circle: {pi_circle}')
  print(f'using sphere: {pi_sphere}')

  fig, ax = plt.subplots()
  ax.set_aspect('equal')
  ax.scatter(x_inside_circle, y_inside_circle, color='g', marker='s')
  ax.scatter(x_outside_circle, y_outside_circle, color='r', marker='s')
  fig.show()
#+end_src
