cdt.html
<div id="outline-container-org58b849b" class="outline-4">
<h4 id="org58b849b"><span class="section-number-4">1.4.1</span> Example</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> random
<span style="color: #0000FF;">import</span> matplotlib.pyplot <span style="color: #0000FF;">as</span> plt

<span style="color: #BA36A5;">n</span> = <span style="color: #D0372D;">10</span>**<span style="color: #D0372D;">3</span>

<span style="color: #BA36A5;">n_inside_circle</span> = <span style="color: #D0372D;">0</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">variables for circle</span>
<span style="color: #BA36A5;">x_inside_circle</span> = <span style="color: #707183;">[]</span>
<span style="color: #BA36A5;">y_inside_circle</span> = <span style="color: #707183;">[]</span>
<span style="color: #BA36A5;">x_outside_circle</span> = <span style="color: #707183;">[]</span>
<span style="color: #BA36A5;">y_outside_circle</span> = <span style="color: #707183;">[]</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">variables for sphere</span>
<span style="color: #BA36A5;">n_inside_sphere</span> = <span style="color: #D0372D;">0</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute number of points for circle</span>
<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span><span style="color: #707183;">(</span>n<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        x_inside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_inside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>
        <span style="color: #0000FF;">continue</span>

    x_outside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
    y_outside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute number inside sphere</span>
<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span><span style="color: #707183;">(</span>n<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">z</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> + z**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        <span style="color: #BA36A5;">n_inside_sphere</span> += <span style="color: #D0372D;">1</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">count variables for circle and sphere</span>
<span style="color: #BA36A5;">n_inside_circle</span> = <span style="color: #006FE0;">len</span><span style="color: #707183;">(</span>x_inside_circle<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute pi for circle and sphere</span>
<span style="color: #BA36A5;">pi_circle</span> = <span style="color: #D0372D;">4</span> * <span style="color: #707183;">(</span>n_inside_circle / n<span style="color: #707183;">)</span>
<span style="color: #BA36A5;">pi_sphere</span> = <span style="color: #D0372D;">6</span> * <span style="color: #707183;">(</span>n_inside_sphere / n<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">print results</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'using circle: {pi_circle}'</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'using sphere: {pi_sphere}'</span><span style="color: #707183;">)</span>

<span style="color: #BA36A5;">fig</span>, <span style="color: #BA36A5;">ax</span> = plt.subplots<span style="color: #707183;">()</span>
ax.set_aspect<span style="color: #707183;">(</span><span style="color: #008000;">'equal'</span><span style="color: #707183;">)</span>
ax.scatter<span style="color: #707183;">(</span>x_inside_circle, y_inside_circle, color=<span style="color: #008000;">'g'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
ax.scatter<span style="color: #707183;">(</span>x_outside_circle, y_outside_circle, color=<span style="color: #008000;">'r'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
fig.show<span style="color: #707183;">()</span>
</pre>
</div>
</div>
</div>
