cdt.org
*** Example
#+begin_src python
  import random
  import matplotlib.pyplot as plt


  def do_iterations(method):
      "Compute pi using the Monte Carlo method. The value of method can be the string 'circle' or 'sphere', which governs the method which is used."
      global n_iter

      x_outside_circle = []
      x_inside_circle = []
      y_inside_circle = []
      y_outside_circle = []
      n_inside_circle = 0

      # loop for circle
      for i in range(n_iter):
          # Use the volume of a sphere is method is set to 'sphere'
          if method == 'sphere':
              x = random.uniform(-1.0, 1.0)
              y = random.uniform(-1.0, 1.0)
              z = random.uniform(-1.0, 1.0)

              if x**2 + y**2 + z**2 <= 1:
                  n_inside_circle += 1

              continue

          # Use the area of a circle is method is set to 'circle
          x = random.uniform(-1.0, 1.0)
          y = random.uniform(-1.0, 1.0)

          if x**2 + y**2 <= 1:
              n_inside_circle += 1
              x_inside_circle.append(x)
              y_inside_circle.append(y)
              continue

          x_outside_circle.append(x)
          y_outside_circle.append(y)

      if method == 'sphere':
          return (n_inside_circle, [], [], [], [])
      else:
          return (n_inside_circle, x_inside_circle, y_inside_circle,
                  x_outside_circle, y_outside_circle)


  import sys

  n_iter = input("Please type the number of iterations: ")
  n_iter = int(n_iter)

  # do circle iterations
  n_inside_circle, x_inside_circle, y_inside_circle, x_outside_circle, y_outside_circle = do_iterations(
      'circle')

  # do sphere iterations
  n_inside_sphere, x_inside_sphere, y_inside_sphere, x_outside_sphere, y_outside_sphere = do_iterations(
      'sphere')

  # compute pi for circle and sphere
  pi_circle = 4 * n_inside_circle / n_iter
  pi_sphere = 6 * (n_inside_sphere / n_iter)
  print('using circle: ', pi_circle)
  print('using sphere: ', pi_sphere)

  fig, ax = plt.subplots()
  ax.set_aspect('equal')
  ax.scatter(x_inside_circle, y_inside_circle, color='g', marker='s')
  ax.scatter(x_outside_circle, y_outside_circle, color='r', marker='s')
  fig.show()
#+end_src
