cdt.html
<div id="outline-container-org26204a9" class="outline-4">
<h4 id="org26204a9"><span class="section-number-4">1.4.2</span> Example</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> random
<span style="color: #0000FF;">import</span> matplotlib.pyplot <span style="color: #0000FF;">as</span> plt


<span style="color: #0000FF;">def</span> <span style="color: #006699;">do_iterations</span><span style="color: #707183;">(</span>method<span style="color: #707183;">)</span>:
    <span style="color: #036A07;">"Compute pi using the Monte Carlo method. The value of method can be the string 'circle' or 'sphere', which governs the method which is used."</span>
    <span style="color: #0000FF;">global</span> n_iter

    <span style="color: #BA36A5;">x_outside_circle</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">x_inside_circle</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">y_inside_circle</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">y_outside_circle</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">n_inside_circle</span> = <span style="color: #D0372D;">0</span>

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">loop for circle</span>
    <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span><span style="color: #707183;">(</span>n_iter<span style="color: #707183;">)</span>:
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Use the volume of a sphere is method is set to 'sphere'</span>
        <span style="color: #0000FF;">if</span> method == <span style="color: #008000;">'sphere'</span>:
            <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
            <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
            <span style="color: #BA36A5;">z</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

            <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> + z**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
                <span style="color: #BA36A5;">n_inside_circle</span> += <span style="color: #D0372D;">1</span>

            <span style="color: #0000FF;">continue</span>

        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Use the area of a circle is method is set to 'circle</span>
        <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
        <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

        <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
            <span style="color: #BA36A5;">n_inside_circle</span> += <span style="color: #D0372D;">1</span>
            x_inside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
            y_inside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>
            <span style="color: #0000FF;">continue</span>

        x_outside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_outside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>

    <span style="color: #0000FF;">if</span> method == <span style="color: #008000;">'sphere'</span>:
        <span style="color: #0000FF;">return</span> <span style="color: #707183;">(</span>n_inside_circle, <span style="color: #7388D6;">[]</span>, <span style="color: #7388D6;">[]</span>, <span style="color: #7388D6;">[]</span>, <span style="color: #7388D6;">[]</span><span style="color: #707183;">)</span>
    <span style="color: #0000FF;">else</span>:
        <span style="color: #0000FF;">return</span> <span style="color: #707183;">(</span>n_inside_circle, x_inside_circle, y_inside_circle,
                x_outside_circle, y_outside_circle<span style="color: #707183;">)</span>


<span style="color: #0000FF;">import</span> sys

<span style="color: #BA36A5;">n_iter</span> = <span style="color: #006FE0;">input</span><span style="color: #707183;">(</span><span style="color: #008000;">"Please type the number of iterations: "</span><span style="color: #707183;">)</span>
<span style="color: #BA36A5;">n_iter</span> = <span style="color: #006FE0;">int</span><span style="color: #707183;">(</span>n_iter<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do circle iterations</span>
<span style="color: #BA36A5;">n_inside_circle</span>, <span style="color: #BA36A5;">x_inside_circle</span>, <span style="color: #BA36A5;">y_inside_circle</span>, <span style="color: #BA36A5;">x_outside_circle</span>, <span style="color: #BA36A5;">y_outside_circle</span> = do_iterations<span style="color: #707183;">(</span>
    <span style="color: #008000;">'circle'</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do sphere iterations</span>
<span style="color: #BA36A5;">n_inside_sphere</span>, <span style="color: #BA36A5;">x_inside_sphere</span>, <span style="color: #BA36A5;">y_inside_sphere</span>, <span style="color: #BA36A5;">x_outside_sphere</span>, <span style="color: #BA36A5;">y_outside_sphere</span> = do_iterations<span style="color: #707183;">(</span>
    <span style="color: #008000;">'sphere'</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute pi for circle and sphere</span>
<span style="color: #BA36A5;">pi_circle</span> = <span style="color: #D0372D;">4</span> * n_inside_circle / n_iter
<span style="color: #BA36A5;">pi_sphere</span> = <span style="color: #D0372D;">6</span> * <span style="color: #707183;">(</span>n_inside_sphere / n_iter<span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span><span style="color: #008000;">'using circle: '</span>, pi_circle<span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span><span style="color: #008000;">'using sphere: '</span>, pi_sphere<span style="color: #707183;">)</span>

<span style="color: #BA36A5;">fig</span>, <span style="color: #BA36A5;">ax</span> = plt.subplots<span style="color: #707183;">()</span>
ax.set_aspect<span style="color: #707183;">(</span><span style="color: #008000;">'equal'</span><span style="color: #707183;">)</span>
ax.scatter<span style="color: #707183;">(</span>x_inside_circle, y_inside_circle, color=<span style="color: #008000;">'g'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
ax.scatter<span style="color: #707183;">(</span>x_outside_circle, y_outside_circle, color=<span style="color: #008000;">'r'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
fig.show<span style="color: #707183;">()</span>
</pre>
</div>
</div>
</div>
