cdt.org
*** Example 1
 #+begin_src python
   import random
   import matplotlib.pyplot as plt

   n_iter = 10**3


   def circle_iteration(x_inside_circle, y_inside_circle, z_inside_circle,
                        x_outside_circle, y_outside_circle, z_outside_circle):

       x = random.uniform(-1.0, 1.0)
       y = random.uniform(-1.0, 1.0)

       if x**2 + y**2 <= 1:
           x_inside_circle.append(x)
           y_inside_circle.append(y)
           return 1
       else:
           x_outside_circle.append(x)
           y_outside_circle.append(y)
           return 0


   def sphere_iteration(x_inside_sphere, y_inside_sphere, z_inside_sphere,
                        x_outside_sphere, y_outside_sphere, z_outside_sphere):

       x = random.uniform(-1.0, 1.0)
       y = random.uniform(-1.0, 1.0)
       z = random.uniform(-1.0, 1.0)

       if x**2 + y**2 + z**2 <= 1:
           x_inside_sphere.append(x)
           y_inside_sphere.append(y)
           z_inside_sphere.append(y)
           return 1
       else:
           x_outside_sphere.append(x)
           y_outside_sphere.append(y)
           z_outside_sphere.append(y)
           return 0


   def do_iterations(values, method):
       "Compute pi using the Monte Carlo method. The value of method can be the string 'circle' or 'sphere', which governs the method which is used."
       n_inside_circle = 0
       x_inside = []
       y_inside = []
       z_inside = []
       x_outside = []
       y_outside = []
       z_outside = []

       for i in range(n_iter):
           n_inside_circle += method(x_inside, y_inside, z_inside, x_outside,
                                     y_outside, z_outside)

       return (n_inside_circle, x_inside, y_inside, z_inside, x_outside,
               y_outside, z_outside)


   def compute_pi_circle(n_total, n_inside):
       return 4 * n_inside / n_total


   def compute_pi_sphere(n_total, n_inside):
       return 6 * n_inside / n_total


   def plot_2D_results(results):
       fig, ax = plt.subplots()
       ax.set_aspect('equal')
       ax.scatter(results[1], results[2], color='g', marker='s')
       ax.scatter(results[4], results[5], color='r', marker='s')
       fig.show()


   n = 10**3

   # do circle iterations
   circle_results = do_iterations(range(n_iter), circle_iteration)

   # do sphere iterations
   sphere_results = do_iterations(range(n_iter), sphere_iteration)

   # compute pi for circle and sphere
   compute_pi_circle(circle_results[0], n_iter)
   compute_pi_sphere(sphere_results[0], n_iter)

   plot_2D_results(circle_results)
 #+end_src
