cdt.org
*** Example 2
 #+begin_src python
   import random
   import matplotlib.pyplot as plt
   import numpy as np

   n_iter = 10**3


   def classify_points(points, radius):
       in_out = np.sum(points ** 2, axis=1)
       return in_out <= radius

   n = 10**3

   # do circle iterations
   circle_points = np.random.random([ n, 2 ])
   circle_inout = classify_points(circle_points, 1)

   # do sphere iterations
   sphere_points = np.random.random([ n, 3 ])
   sphere_inout = classify_points(sphere_points, 1)

   # compute pi for circle and sphere
   pi_circle = 4 * sum(sphere_inout) / n
   sphere_circle = 6 * sum(sphere_inout) / n

   fig, ax = plt.subplots()
   ax.set_aspect('equal')
   in_points = circle_points[circle_inout, :]
   out_points = circle_points[not circle_inout, :]

   ax.scatter(in_points[1], in_points[2], color='g', marker='s')
   ax.scatter(out_points[1], out_points[2], color='r', marker='s')
   fig.show()

 #+end_src
