cdt.html
<div id="outline-container-org2047d25" class="outline-4">
<h4 id="org2047d25"><span class="section-number-4">1.4.4</span> Example 2</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> random
<span style="color: #0000FF;">import</span> matplotlib.pyplot <span style="color: #0000FF;">as</span> plt
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #BA36A5;">n_iter</span> = <span style="color: #D0372D;">10</span>**<span style="color: #D0372D;">3</span>


<span style="color: #0000FF;">def</span> <span style="color: #006699;">classify_points</span><span style="color: #707183;">(</span>points, radius<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">in_out</span> = np.<span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>points ** <span style="color: #D0372D;">2</span>, axis=<span style="color: #D0372D;">1</span><span style="color: #707183;">)</span>
    <span style="color: #0000FF;">return</span> in_out &lt;= radius

<span style="color: #BA36A5;">n</span> = <span style="color: #D0372D;">10</span>**<span style="color: #D0372D;">3</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do circle iterations</span>
<span style="color: #BA36A5;">circle_points</span> = np.random.random<span style="color: #707183;">(</span><span style="color: #7388D6;">[</span> n, <span style="color: #D0372D;">2</span> <span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #BA36A5;">circle_inout</span> = classify_points<span style="color: #707183;">(</span>circle_points, <span style="color: #D0372D;">1</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do sphere iterations</span>
<span style="color: #BA36A5;">sphere_points</span> = np.random.random<span style="color: #707183;">(</span><span style="color: #7388D6;">[</span> n, <span style="color: #D0372D;">3</span> <span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #BA36A5;">sphere_inout</span> = classify_points<span style="color: #707183;">(</span>sphere_points, <span style="color: #D0372D;">1</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute pi for circle and sphere</span>
<span style="color: #BA36A5;">pi_circle</span> = <span style="color: #D0372D;">4</span> * <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>sphere_inout<span style="color: #707183;">)</span> / n
<span style="color: #BA36A5;">sphere_circle</span> = <span style="color: #D0372D;">6</span> * <span style="color: #006FE0;">sum</span><span style="color: #707183;">(</span>sphere_inout<span style="color: #707183;">)</span> / n

<span style="color: #BA36A5;">fig</span>, <span style="color: #BA36A5;">ax</span> = plt.subplots<span style="color: #707183;">()</span>
ax.set_aspect<span style="color: #707183;">(</span><span style="color: #008000;">'equal'</span><span style="color: #707183;">)</span>
<span style="color: #BA36A5;">in_points</span> = circle_points<span style="color: #707183;">[</span>circle_inout, :<span style="color: #707183;">]</span>
<span style="color: #BA36A5;">out_points</span> = circle_points<span style="color: #707183;">[</span><span style="color: #0000FF;">not</span> circle_inout, :<span style="color: #707183;">]</span>

ax.scatter<span style="color: #707183;">(</span>in_points<span style="color: #7388D6;">[</span><span style="color: #D0372D;">1</span><span style="color: #7388D6;">]</span>, in_points<span style="color: #7388D6;">[</span><span style="color: #D0372D;">2</span><span style="color: #7388D6;">]</span>, color=<span style="color: #008000;">'g'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
ax.scatter<span style="color: #707183;">(</span>out_points<span style="color: #7388D6;">[</span><span style="color: #D0372D;">1</span><span style="color: #7388D6;">]</span>, out_points<span style="color: #7388D6;">[</span><span style="color: #D0372D;">2</span><span style="color: #7388D6;">]</span>, color=<span style="color: #008000;">'r'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
fig.show<span style="color: #707183;">()</span>

</pre>
</div>
</div>
</div>
