cdt.org
*** Example
 #+begin_src python
   import random
   import matplotlib.pyplot as plt


   def circle_iteration(x_inside_circle, y_inside_circle, z_inside_circle,
                        x_outside_circle, y_outside_circle, z_outside_circle):
       x = random.uniform(-1.0, 1.0)
       y = random.uniform(-1.0, 1.0)

       if x**2 + y**2 <= 1:
           n_inside = 1
           x_inside_circle.append(x)
           y_inside_circle.append(y)
       else:
           n_inside = 0
           x_outside_circle.append(x)
           y_outside_circle.append(y)

       return n_inside


   def sphere_iteration(x_inside_circle, y_inside_circle, z_inside_circle,
                        x_outside_circle, y_outside_circle, z_outside_circle):
       x = random.uniform(-1.0, 1.0)
       y = random.uniform(-1.0, 1.0)
       z = random.uniform(-1.0, 1.0)

       if x**2 + y**2 + z**2 <= 1:
           n_inside = 1
           x_inside_circle.append(x)
           y_inside_circle.append(y)
           z_inside_circle.append(y)
       else:
           n_inside = 0
           x_outside_circle.append(x)
           y_outside_circle.append(y)

       return n_inside


   def do_iterations(values, method):
       "Compute pi using the Monte Carlo method. The value of method can be the string 'circle' or 'sphere', which governs the method which is used."
       # loop for circle
       n_inside = 0
       x_inside = []
       y_inside = []
       z_inside = []
       x_outside = []
       y_outside = []
       z_outside = []

       for i in range(n_iter):
           n_inside += method(x_inside, y_inside, z_inside, x_outside, y_outside,
                              z_outside)

       return n_inside, x_inside, y_inside, z_inside, x_outside, y_outside, z_outside


   def compute_pi_circle(n_inside, n_total):
       return 4 * n_inside / n_total


   def compute_pi_sphere(n_inside, n_total):
       return 6 * n_inside / n_total


   def plot_2D_results(results):
       fig, ax = plt.subplots()
       ax.set_aspect('equal')
       ax.scatter(results[1], results[2], color='g', marker='s')
       ax.scatter(results[4], results[5], color='r', marker='s')
       fig.show()


   n_iter = 10**3

   # do circle iterations
   circle_results = do_iterations(range(n_iter), circle_iteration)

   # do sphere iterations
   sphere_results = do_iterations(range(n_iter), sphere_iteration)

   # compute pi for circle and sphere
   pi_circle = compute_pi_circle(circle_results[0], n_iter)
   pi_sphere = compute_pi_sphere(sphere_results[0], n_iter)

   # plot the results for a circle
   plot_2D_results(circle_results)

   print(f'pi circle: {pi_circle}')
   print(f'pi sphere: {pi_sphere}')
   print(f'difference: {np.absolute(pi_circle - pi_sphere)}')
 #+end_src
