cdt.html
<div id="outline-container-org76190ae" class="outline-4">
<h4 id="org76190ae"><span class="section-number-4">1.4.5</span> Example</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> random
<span style="color: #0000FF;">import</span> matplotlib.pyplot <span style="color: #0000FF;">as</span> plt


<span style="color: #0000FF;">def</span> <span style="color: #006699;">circle_iteration</span><span style="color: #707183;">(</span>x_inside_circle, y_inside_circle, z_inside_circle,
                     x_outside_circle, y_outside_circle, z_outside_circle<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        <span style="color: #BA36A5;">n_inside</span> = <span style="color: #D0372D;">1</span>
        x_inside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_inside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">n_inside</span> = <span style="color: #D0372D;">0</span>
        x_outside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_outside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>

    <span style="color: #0000FF;">return</span> n_inside


<span style="color: #0000FF;">def</span> <span style="color: #006699;">sphere_iteration</span><span style="color: #707183;">(</span>x_inside_circle, y_inside_circle, z_inside_circle,
                     x_outside_circle, y_outside_circle, z_outside_circle<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">z</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> + z**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        <span style="color: #BA36A5;">n_inside</span> = <span style="color: #D0372D;">1</span>
        x_inside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_inside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>
        z_inside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">n_inside</span> = <span style="color: #D0372D;">0</span>
        x_outside_circle.append<span style="color: #707183;">(</span>x<span style="color: #707183;">)</span>
        y_outside_circle.append<span style="color: #707183;">(</span>y<span style="color: #707183;">)</span>

    <span style="color: #0000FF;">return</span> n_inside


<span style="color: #0000FF;">def</span> <span style="color: #006699;">do_iterations</span><span style="color: #707183;">(</span>values, method<span style="color: #707183;">)</span>:
    <span style="color: #036A07;">"Compute pi using the Monte Carlo method. The value of method can be the string 'circle' or 'sphere', which governs the method which is used."</span>
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">loop for circle</span>
    <span style="color: #BA36A5;">n_inside</span> = <span style="color: #D0372D;">0</span>
    <span style="color: #BA36A5;">x_inside</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">y_inside</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">z_inside</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">x_outside</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">y_outside</span> = <span style="color: #707183;">[]</span>
    <span style="color: #BA36A5;">z_outside</span> = <span style="color: #707183;">[]</span>

    <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span><span style="color: #707183;">(</span>n_iter<span style="color: #707183;">)</span>:
        <span style="color: #BA36A5;">n_inside</span> += method<span style="color: #707183;">(</span>x_inside, y_inside, z_inside, x_outside, y_outside,
                           z_outside<span style="color: #707183;">)</span>

    <span style="color: #0000FF;">return</span> n_inside, x_inside, y_inside, z_inside, x_outside, y_outside, z_outside


<span style="color: #0000FF;">def</span> <span style="color: #006699;">compute_pi_circle</span><span style="color: #707183;">(</span>n_inside, n_total<span style="color: #707183;">)</span>:
    <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">4</span> * n_inside / n_total


<span style="color: #0000FF;">def</span> <span style="color: #006699;">compute_pi_sphere</span><span style="color: #707183;">(</span>n_inside, n_total<span style="color: #707183;">)</span>:
    <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">6</span> * n_inside / n_total


<span style="color: #0000FF;">def</span> <span style="color: #006699;">plot_2D_results</span><span style="color: #707183;">(</span>results<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">fig</span>, <span style="color: #BA36A5;">ax</span> = plt.subplots<span style="color: #707183;">()</span>
    ax.set_aspect<span style="color: #707183;">(</span><span style="color: #008000;">'equal'</span><span style="color: #707183;">)</span>
    ax.scatter<span style="color: #707183;">(</span>results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">1</span><span style="color: #7388D6;">]</span>, results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">2</span><span style="color: #7388D6;">]</span>, color=<span style="color: #008000;">'g'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
    ax.scatter<span style="color: #707183;">(</span>results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">4</span><span style="color: #7388D6;">]</span>, results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">5</span><span style="color: #7388D6;">]</span>, color=<span style="color: #008000;">'r'</span>, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>
    fig.show<span style="color: #707183;">()</span>


<span style="color: #BA36A5;">n_iter</span> = <span style="color: #D0372D;">10</span>**<span style="color: #D0372D;">3</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do circle iterations</span>
<span style="color: #BA36A5;">circle_results</span> = do_iterations<span style="color: #707183;">(</span><span style="color: #006FE0;">range</span><span style="color: #7388D6;">(</span>n_iter<span style="color: #7388D6;">)</span>, circle_iteration<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do sphere iterations</span>
<span style="color: #BA36A5;">sphere_results</span> = do_iterations<span style="color: #707183;">(</span><span style="color: #006FE0;">range</span><span style="color: #7388D6;">(</span>n_iter<span style="color: #7388D6;">)</span>, sphere_iteration<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute pi for circle and sphere</span>
<span style="color: #BA36A5;">pi_circle</span> = compute_pi_circle<span style="color: #707183;">(</span>circle_results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">0</span><span style="color: #7388D6;">]</span>, n_iter<span style="color: #707183;">)</span>
<span style="color: #BA36A5;">pi_sphere</span> = compute_pi_sphere<span style="color: #707183;">(</span>sphere_results<span style="color: #7388D6;">[</span><span style="color: #D0372D;">0</span><span style="color: #7388D6;">]</span>, n_iter<span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">plot the results for a circle</span>
plot_2D_results<span style="color: #707183;">(</span>circle_results<span style="color: #707183;">)</span>

<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'pi circle: {pi_circle}'</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'pi sphere: {pi_sphere}'</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'difference: {np.absolute(pi_circle - pi_sphere)}'</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
