cdt.org
*** Example
    #+begin_src python
      import random
      import matplotlib.pyplot as plt

      n_iter = 10**3


      def plot_point_on_matplotlib_axis(ax, x, y, color):
          if ax:
              ax.scatter(x, y, color=color, marker='s')


      def circle_iteration(ax=None):
          x = random.uniform(-1.0, 1.0)
          y = random.uniform(-1.0, 1.0)

          if x**2 + y**2 <= 1:
              plot_point_on_matplotlib_axis(ax, x, y, 'g')
              return 1
          else:
              plot_point_on_matplotlib_axis(ax, x, y, 'r')
              return 0

          return n_inside


      def sphere_iteration(ax=None):
          x = random.uniform(-1.0, 1.0)
          y = random.uniform(-1.0, 1.0)
          z = random.uniform(-1.0, 1.0)

          if x**2 + y**2 + z**2 <= 1:
              plot_point_on_matplotlib_axis(ax, x, y, 'g')
              return 1
          else:
              plot_point_on_matplotlib_axis(ax, x, y, 'g')
              return 0


      fig, ax = plt.subplots()
      ax.set_aspect('equal')

      # do circle iterations
      n_inside_circle = 0
      n_inside_sphere = 0

      for i in range(n_iter):
          n_inside_circle += circle_iteration(ax)
          n_inside_sphere += sphere_iteration()

      # compute pi for circle and sphere
      pi_circle = 4 * n_inside_circle / n_iter
      pi_sphere = 6 * n_inside_sphere / n_iter

      print(f'pi circle: {pi_circle}')
      print(f'pi sphere: {pi_sphere}')

      fig.show()
    #+end_src
* Day Two
** Code challenge intro :SLIDES:
*** The scenario
 - You are the small software house specialising in machine learning
 - You've been hired by an (imaginary) oil shipping company
 - They have asked you to deliver some software to automate their business decisions
 - You will meet with them periodically to report progress
 - During the meetings the requirements will change or evolve from the initial request, sometimes based on your findings, sometimes based on changes to business needs
*** Your job
 - Manage the relationship
  * run the meetings with client
  * agree realistic deliverables
  * keep minutes
 - Manage internal process
  * have an internal schedule of meetings
  * have good communication within the team
  * ensure you're working as a team and delivering the prodouct
 - Report to the customer on your progress
 - Deliver a software product
*** You should expect that
 - The problem will not be completely specified in advance. The requirements will evolve (and sometimes change) over time, as the needs of the company change and evolve
 - The customer will not be a domain expert
 - You'll need to work on different tasks in parallel
*** The problem
... need a detailed problem specification here (i.e. what is their first task). Also, maybe a contact email address for them to ask questions....?????
** What challenges do you anticipate delivering this software in a team, and responding to customer needs?
- We need to get on with others
- conflicting views on what is "good"
- predicting the future is hard!
- Different understanding of the problem
- the requirements can change abruptly
- communication: the customer can misunderstand the requirement
- communication: you can misunderstand each other
- coordination/parallelisation/working on the same thing
- enthusiasm (?) - I'm working on something I don't want to be
- breaking brittle code
- information (about what others are doing)
- wastage/redundancy in task repetition
- task pre-reqs
- responding to requirement
- different ideas on the end goal
- pieces of code which are not compatible
- work happening in parallel could change the same parts of the code
- misunderstanding requirements
- Subjectivity (e.g. code quality, development practices, style)
- People can be easy to offended/alienate
** Can you imagine some ways of working that might resolve these issues? discuss this in your group, and write a series of short bullet points describing the process you would use.
