cdt.html
<div id="outline-container-org066da16" class="outline-4">
<h4 id="org066da16"><span class="section-number-4">1.4.6</span> Example</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> random
<span style="color: #0000FF;">import</span> matplotlib.pyplot <span style="color: #0000FF;">as</span> plt

<span style="color: #BA36A5;">n_iter</span> = <span style="color: #D0372D;">10</span>**<span style="color: #D0372D;">3</span>


<span style="color: #0000FF;">def</span> <span style="color: #006699;">plot_point_on_matplotlib_axis</span><span style="color: #707183;">(</span>ax, x, y, color<span style="color: #707183;">)</span>:
    <span style="color: #0000FF;">if</span> ax:
        ax.scatter<span style="color: #707183;">(</span>x, y, color=color, marker=<span style="color: #008000;">'s'</span><span style="color: #707183;">)</span>


<span style="color: #0000FF;">def</span> <span style="color: #006699;">circle_iteration</span><span style="color: #707183;">(</span>ax=<span style="color: #D0372D;">None</span><span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        plot_point_on_matplotlib_axis<span style="color: #707183;">(</span>ax, x, y, <span style="color: #008000;">'g'</span><span style="color: #707183;">)</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">1</span>
    <span style="color: #0000FF;">else</span>:
        plot_point_on_matplotlib_axis<span style="color: #707183;">(</span>ax, x, y, <span style="color: #008000;">'r'</span><span style="color: #707183;">)</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">0</span>

    <span style="color: #0000FF;">return</span> n_inside


<span style="color: #0000FF;">def</span> <span style="color: #006699;">sphere_iteration</span><span style="color: #707183;">(</span>ax=<span style="color: #D0372D;">None</span><span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">x</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">y</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">z</span> = random.uniform<span style="color: #707183;">(</span>-<span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>

    <span style="color: #0000FF;">if</span> x**<span style="color: #D0372D;">2</span> + y**<span style="color: #D0372D;">2</span> + z**<span style="color: #D0372D;">2</span> &lt;= <span style="color: #D0372D;">1</span>:
        plot_point_on_matplotlib_axis<span style="color: #707183;">(</span>ax, x, y, <span style="color: #008000;">'g'</span><span style="color: #707183;">)</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">1</span>
    <span style="color: #0000FF;">else</span>:
        plot_point_on_matplotlib_axis<span style="color: #707183;">(</span>ax, x, y, <span style="color: #008000;">'g'</span><span style="color: #707183;">)</span>
        <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">0</span>


<span style="color: #BA36A5;">fig</span>, <span style="color: #BA36A5;">ax</span> = plt.subplots<span style="color: #707183;">()</span>
ax.set_aspect<span style="color: #707183;">(</span><span style="color: #008000;">'equal'</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">do circle iterations</span>
<span style="color: #BA36A5;">n_inside_circle</span> = <span style="color: #D0372D;">0</span>
<span style="color: #BA36A5;">n_inside_sphere</span> = <span style="color: #D0372D;">0</span>

<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span><span style="color: #707183;">(</span>n_iter<span style="color: #707183;">)</span>:
    <span style="color: #BA36A5;">n_inside_circle</span> += circle_iteration<span style="color: #707183;">(</span>ax<span style="color: #707183;">)</span>
    <span style="color: #BA36A5;">n_inside_sphere</span> += sphere_iteration<span style="color: #707183;">()</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compute pi for circle and sphere</span>
<span style="color: #BA36A5;">pi_circle</span> = <span style="color: #D0372D;">4</span> * n_inside_circle / n_iter
<span style="color: #BA36A5;">pi_sphere</span> = <span style="color: #D0372D;">6</span> * n_inside_sphere / n_iter

<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'pi circle: {pi_circle}'</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">print</span><span style="color: #707183;">(</span>f<span style="color: #008000;">'pi sphere: {pi_sphere}'</span><span style="color: #707183;">)</span>

fig.show<span style="color: #707183;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd185d30" class="outline-2">
<h2 id="orgd185d30"><span class="section-number-2">2</span> Day Two</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdd35fc8" class="outline-3">
<h3 id="orgdd35fc8"><span class="section-number-3">2.1</span> Code challenge intro&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc163687" class="outline-4">
<h4 id="orgc163687"><span class="section-number-4">2.1.1</span> The scenario</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>You are the small software house specialising in machine learning</li>
<li>You've been hired by an (imaginary) oil shipping company</li>
<li>They have asked you to deliver some software to automate their business decisions</li>
<li>You will meet with them periodically to report progress</li>
<li>During the meetings the requirements will change or evolve from the initial request, sometimes based on your findings, sometimes based on changes to business needs</li>
</ul>
</div>
</div>
<div id="outline-container-org0e43885" class="outline-4">
<h4 id="org0e43885"><span class="section-number-4">2.1.2</span> Your job</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Manage the relationship
<ul class="org-ul">
<li>run the meetings with client</li>
<li>agree realistic deliverables</li>
<li>keep minutes</li>
</ul></li>
<li>Manage internal process
<ul class="org-ul">
<li>have an internal schedule of meetings</li>
<li>have good communication within the team</li>
<li>ensure you're working as a team and delivering the prodouct</li>
</ul></li>
<li>Report to the customer on your progress</li>
<li>Deliver a software product</li>
</ul>
</div>
</div>
<div id="outline-container-orgcba015b" class="outline-4">
<h4 id="orgcba015b"><span class="section-number-4">2.1.3</span> You should expect that</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>The problem will not be completely specified in advance. The requirements will evolve (and sometimes change) over time, as the needs of the company change and evolve</li>
<li>The customer will not be a domain expert</li>
<li>You'll need to work on different tasks in parallel</li>
</ul>
</div>
</div>
<div id="outline-container-org4b75eb4" class="outline-4">
<h4 id="org4b75eb4"><span class="section-number-4">2.1.4</span> The problem</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
&#x2026; need a detailed problem specification here (i.e. what is their first task). Also, maybe a contact email address for them to ask questions&#x2026;.?????
</p>
</div>
</div>
</div>
<div id="outline-container-orge39271d" class="outline-3">
<h3 id="orge39271d"><span class="section-number-3">2.2</span> What challenges do you anticipate delivering this software in a team, and responding to customer needs?</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>We need to get on with others</li>
<li>conflicting views on what is "good"</li>
<li>predicting the future is hard!</li>
<li>Different understanding of the problem</li>
<li>the requirements can change abruptly</li>
<li>communication: the customer can misunderstand the requirement</li>
<li>communication: you can misunderstand each other</li>
<li>coordination/parallelisation/working on the same thing</li>
<li>enthusiasm (?) - I'm working on something I don't want to be</li>
<li>breaking brittle code</li>
<li>information (about what others are doing)</li>
<li>wastage/redundancy in task repetition</li>
<li>task pre-reqs</li>
<li>responding to requirement</li>
<li>different ideas on the end goal</li>
<li>pieces of code which are not compatible</li>
<li>work happening in parallel could change the same parts of the code</li>
<li>misunderstanding requirements</li>
<li>Subjectivity (e.g. code quality, development practices, style)</li>
<li>People can be easy to offended/alienate</li>
</ul>
</div>
</div>
<div id="outline-container-org4b57c27" class="outline-3">
<h3 id="org4b57c27"><span class="section-number-3">2.3</span> Can you imagine some ways of working that might resolve these issues? discuss this in your group, and write a series of short bullet points describing the process you would use.</h3>
</div>
