cdt.org
** The proposed methodology :SLIDES:
  - Setup
    * Sign up for a free trello account
    * Sign up for a free slack account
    * Create a trello board with columns waiting, active, review, completed.
    * Create a slack channel called #standup
  - Development will happen in blocks of two weeks, which we'll refer to as a "sprint"
  - 1) You'll meet with the customer at the start of the sprint
  - 2) Immediately after the sprint, you'll hold a sprint planning meeting. You'll have some support to do this initially.
    * Write a list of tasks
    * Discuss the tasks (ensure that they're well-defined) and estimate their "complexity"
    * Choose the tasks to perform between now and the next planning meeting
    * Don't choose who will do them
    * Add the tasks into trello as "waiting"
  - 3) As a team, work on the agreed targets.
    * Choose a task
    * Assign yourself to the task by adding your name before the task title
    * Move the task to the "active" column
    * Complete the task
    * Move the task to the "review" column
    * Ask on slack for someone to code review your changes
    * Choose your next task
  - 4) Once you've finished a task, as someone to code review it
    * The aim is to make the code better
    * Be honest, and discuss the suggestions openly
    * Be ready to admit a better way of doing things
    * Avoid taking changes personally
    * You don't have to implement suggestions!
  - 5) You'll hold a "daily" standup (we recommend twice a week, at a specified time initially)
    * On a specific slack channel you'll write/record you'll answer the questions:
     - What have I done since last standup?
     - What do I expect to do before next standup?
     - What problems/issues do I expect?
     - This may encourage some conversation, but be careful not to confuse the main standup thread with conversation
  - 6) Use version control to manage your development
    * Develop in a specific branch
    * Merge your work into master branch once you've finished a task
  - 7) You'll have access to a technical consultant?
  - 8) Towards the end of the sprint, you'll meet your "boss", who will approve the solution before you meet the customer
  - 9) You'll end the sprint (and start the next) by meeting with the customer to report on progress and agree a new set of targets for the next meeting.
