cdt.html
<div id="outline-container-org6fc0be5" class="outline-3">
<h3 id="org6fc0be5"><span class="section-number-3">2.4</span> The proposed methodology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SLIDES">SLIDES</span></span></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Setup
<ul class="org-ul">
<li>Sign up for a free trello account</li>
<li>Sign up for a free slack account</li>
<li>Create a trello board with columns waiting, active, review, completed.</li>
<li>Create a slack channel called #standup</li>
</ul></li>
<li>Development will happen in blocks of two weeks, which we'll refer to as a "sprint"</li>
<li>1) You'll meet with the customer at the start of the sprint</li>
<li>2) Immediately after the sprint, you'll hold a sprint planning meeting. You'll have some support to do this initially.
<ul class="org-ul">
<li>Write a list of tasks</li>
<li>Discuss the tasks (ensure that they're well-defined) and estimate their "complexity"</li>
<li>Choose the tasks to perform between now and the next planning meeting</li>
<li>Don't choose who will do them</li>
<li>Add the tasks into trello as "waiting"</li>
</ul></li>
<li>3) As a team, work on the agreed targets.
<ul class="org-ul">
<li>Choose a task</li>
<li>Assign yourself to the task by adding your name before the task title</li>
<li>Move the task to the "active" column</li>
<li>Complete the task</li>
<li>Move the task to the "review" column</li>
<li>Ask on slack for someone to code review your changes</li>
<li>Choose your next task</li>
</ul></li>
<li>4) Once you've finished a task, as someone to code review it
<ul class="org-ul">
<li>The aim is to make the code better</li>
<li>Be honest, and discuss the suggestions openly</li>
<li>Be ready to admit a better way of doing things</li>
<li>Avoid taking changes personally</li>
<li>You don't have to implement suggestions!</li>
</ul></li>
<li>5) You'll hold a "daily" standup (we recommend twice a week, at a specified time initially)
<ul class="org-ul">
<li>On a specific slack channel you'll write/record you'll answer the questions:
<ul class="org-ul">
<li>What have I done since last standup?</li>
<li>What do I expect to do before next standup?</li>
<li>What problems/issues do I expect?</li>
<li>This may encourage some conversation, but be careful not to confuse the main standup thread with conversation</li>
</ul></li>
</ul></li>
<li>6) Use version control to manage your development
<ul class="org-ul">
<li>Develop in a specific branch</li>
<li>Merge your work into master branch once you've finished a task</li>
</ul></li>
<li>7) You'll have access to a technical consultant?</li>
<li>8) Towards the end of the sprint, you'll meet your "boss", who will approve the solution before you meet the customer</li>
<li>9) You'll end the sprint (and start the next) by meeting with the customer to report on progress and agree a new set of targets for the next meeting.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Dawson</p>
<p class="date">Created: 2019-09-24 Tue 11:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
